In [2]:
import pandas as pd
import numpy as np

# null values

In [3]:
data = {
    'name': ["hari","akhil","kumar" , 'krishna'],
    'age': [10,20,30,0],
    "year":[np.nan,1999,1998,1997]       # np.nan = not an number
}    
data

{'name': ['hari', 'akhil', 'kumar', 'krishna'],
 'age': [10, 20, 30, 0],
 'year': [nan, 1999, 1998, 1997]}

###  DataFrame

In [4]:
df1 = pd.DataFrame(data)
df1

      name  age    year
0     hari   10     NaN
1    akhil   20  1999.0
2    kumar   30  1998.0
3  krishna    0  1997.0

## Is null ()

In [5]:
df1.isnull()    # it show only null , not an 0

    name    age   year
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False  False

###  count how many of null values

In [6]:
df1.isnull().sum()

name    0
age     0
year    1
dtype: int64

##  fill the null value

In [7]:
df1.fillna(4)

      name  age    year
0     hari   10     4.0
1    akhil   20  1999.0
2    kumar   30  1998.0
3  krishna    0  1997.0

## Drop the null value

In [14]:
df1.dropna(axis = 0)       # axis = 0 remove the row

      name  age    year
1    akhil   20  1999.0
2    kumar   30  1998.0
3  krishna    0  1997.0

In [12]:
df1.dropna(axis = 1)     # axis = 1 remove the column

      name  age
0     hari   10
1    akhil   20
2    kumar   30
3  krishna    0

In [10]:
df1.notnull()

   name   age   year
0  True  True  False
1  True  True   True
2  True  True   True
3  True  True   True